Service - Income Tax/sample messages/file_request_ir9_all_attachments.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <add:Action xmlns:add="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Returns/Return/File</add:Action>
    </soap:Header>
    <soap:Body>
        <ret:File xmlns:ret="https://services.ird.govt.nz/GWS/Returns/">
            <ret:ReturnFileRequestMsg>
                <fil:FileRequestWrapper xmlns:fil="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest">
                    <r9:fileRequest xmlns:r9="urn:www.ird.govt.nz/GWS:types/ReturnIR9.v1" xmlns:rc="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                        <rc:fileHeader xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v2">
                            <cmn:softwareProviderData>
                                <cmn:softwareProvider>SoftwareProvider</cmn:softwareProvider>
                                <cmn:softwarePlatform>SoftwarePlatform</cmn:softwarePlatform>
                                <cmn:softwareRelease>1</cmn:softwareRelease>
                            </cmn:softwareProviderData>
                            <cmn:identifier IdentifierValueType="IRD">056632778</cmn:identifier>
                            <cmn:accountType>INC</cmn:accountType>
                            <rc:periodEndDate>2023-03-31</rc:periodEndDate>
                            <rc:majorFormType>INC</rc:majorFormType>
                            <rc:minorFormType>9</rc:minorFormType>
                        </rc:fileHeader>
                        <rc:fileBody>
                            <rc:standardFields>
                                <rc:isNilReturn>false</rc:isNilReturn>
                                <rc:isFinalReturn>false</rc:isFinalReturn>
                                <rc:amendmentRequest>
                                    <rc:isAmended>false</rc:isAmended>
                                    <rc:amendReason/>
                                    <rc:amendDetails/>
                                </rc:amendmentRequest>
                            </rc:standardFields>
                            <rc:formFields xsi:type="r9:FormFieldsType" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ic="urn:www.ird.govt.nz/GWS:types/IncomeReturnCommon.v1">
                                <r9:incorporatedBody>true</r9:incorporatedBody>
                                <r9:typeOfClubOrSociety>F</r9:typeOfClubOrSociety>
                                <r9:residentialRentalIncome>
                                    <ic:indicator>I</ic:indicator>
                                    <ic:grossResRentalIncome>600.00</ic:grossResRentalIncome>
                                    <ic:netBrightlineProfits>750.00</ic:netBrightlineProfits>
                                    <ic:otherResIncome>750.00</ic:otherResIncome>
                                    <ic:totalIncome>2100.00</ic:totalIncome>
                                    <ic:residentialRentalDeductions>1000.00</ic:residentialRentalDeductions>
                                    <ic:excessDeductionsBroughtForward>0.00</ic:excessDeductionsBroughtForward>
                                    <ic:deductionsClaimedThisYear>1000.00</ic:deductionsClaimedThisYear>
                                    <ic:netIncome>1100.00</ic:netIncome>
                                    <ic:excessDeductionsCarriedForward>0.00</ic:excessDeductionsCarriedForward>
                                </r9:residentialRentalIncome>
                                <r9:propertyInterestLimitation>
                                    <ic:totalInterest>1000.00</ic:totalInterest>
                                    <ic:interestExpenseClaimed>1000.00</ic:interestExpenseClaimed>
                                    <ic:interestExpenseClaimedReason>
                                        <ic:notResidentialOrMaoriExempt>true</ic:notResidentialOrMaoriExempt>
                                        <ic:propertyNotInNz>true</ic:propertyNotInNz>
                                        <ic:loansDrawnDown>true</ic:loansDrawnDown>
                                        <ic:newBuildExemption>true</ic:newBuildExemption>
                                        <ic:developmentExemption>true</ic:developmentExemption>
                                        <ic:emergencyTransitionalSocialCouncil>true</ic:emergencyTransitionalSocialCouncil>
                                        <ic:buildToRentExclusion>false</ic:buildToRentExclusion>
                                    </ic:interestExpenseClaimedReason>
                                </r9:propertyInterestLimitation>
                                <r9:saleOfProperty>0.00</r9:saleOfProperty>
                                <r9:friendlyNetIncome>10000.00</r9:friendlyNetIncome>
                                <r9:interest>0.00</r9:interest>
                                <r9:dividends>0.00</r9:dividends>
                                <r9:taxableMADistributions>0.00</r9:taxableMADistributions>
                                <r9:otherIncome>0.00</r9:otherIncome>
                                <r9:incomeTaxDeductionForNonProfit>2000.00</r9:incomeTaxDeductionForNonProfit>
                                <r9:donationsDeduction>1000.00</r9:donationsDeduction>
                                <r9:netIncome>9000.00</r9:netIncome>
                                <r9:lossesBroughtForward>0.00</r9:lossesBroughtForward>
                                <r9:lossCarriedBackPriorYear>0.00</r9:lossCarriedBackPriorYear>
                                <r9:totalTaxableIncome>9000.00</r9:totalTaxableIncome>
                                <r9:taxOnTaxableIncome>2520.00</r9:taxOnTaxableIncome>
                                <r9:overseasTaxPaid>1800.00</r9:overseasTaxPaid>
                                <r9:imputationCreditsReceived>1000.00</r9:imputationCreditsReceived>
                                <r9:imputationBroughtForward>0.00</r9:imputationBroughtForward>
                                <r9:researchAndDevelopment>
                                    <ic:creditBroughtForward>0.00</ic:creditBroughtForward>
                                    <ic:nonrefundableCredit>0.00</ic:nonrefundableCredit>
                                    <ic:refundableCredit>0.00</ic:refundableCredit>
                                </r9:researchAndDevelopment>
                                <r9:totalRWTWithheld>1000.00</r9:totalRWTWithheld>
                                <r9:rlwtCredit>0.00</r9:rlwtCredit>
                                <r9:otherTaxCredits>1000.00</r9:otherTaxCredits>
                                <r9:residualIncomeTax>-2000.00</r9:residualIncomeTax>
                                <r9:overpaymentProvisionalTax>0.00</r9:overpaymentProvisionalTax>
                                <r9:provisionalTax>
                                    <ic:provisionalTaxOption>STD</ic:provisionalTaxOption>
                                    <ic:provisionalTaxPayable>1000</ic:provisionalTaxPayable>
                                    <ic:provisionalTaxStartDate>2019-02-01</ic:provisionalTaxStartDate>
                                </r9:provisionalTax>
                                <r9:attachmentForms>
                                    <ic:attachment>
                                        <ic:formType>10</ic:formType>
                                        <ic:formFields xsi:type="r10:FormFieldsType" xmlns:r10="urn:www.ird.govt.nz/GWS:types/ReturnIR10.v1">
                                            <r10:multipleActivity>true</r10:multipleActivity>
                                            <r10:grossSalesAndServiceIncome>1000.00</r10:grossSalesAndServiceIncome>
                                            <r10:openingStock>1000.00</r10:openingStock>
                                            <r10:purchases>1000.00</r10:purchases>
                                            <r10:closingStock>1000.00</r10:closingStock>
                                            <r10:grossProfit>1000.00</r10:grossProfit>
                                            <r10:interestReceived>1000.00</r10:interestReceived>
                                            <r10:dividendsReceived>1000.00</r10:dividendsReceived>
                                            <r10:rentLeaseLicenceIncome>1000.00</r10:rentLeaseLicenceIncome>
                                            <r10:otherIncome>1000.00</r10:otherIncome>
                                            <r10:totalIncome>5000.00</r10:totalIncome>
                                            <r10:badDebts>1000.00</r10:badDebts>
                                            <r10:depreciationAndAmortisation>1000.00</r10:depreciationAndAmortisation>
                                            <r10:insurance>1000.00</r10:insurance>
                                            <r10:interestExpense>1000.00</r10:interestExpense>
                                            <r10:fees>1000.00</r10:fees>
                                            <r10:rates>1000.00</r10:rates>
                                            <r10:rentsLeasesLicences>1000.00</r10:rentsLeasesLicences>
                                            <r10:repairsAndMaintenance>1000.00</r10:repairsAndMaintenance>
                                            <r10:researchAndDevelopment>1000.00</r10:researchAndDevelopment>
                                            <r10:relatedPartyRemuneration>1000.00</r10:relatedPartyRemuneration>
                                            <r10:salariesAndWages>1000.00</r10:salariesAndWages>
                                            <r10:contractorPayments>1000.00</r10:contractorPayments>
                                            <r10:otherExpenses>1000.00</r10:otherExpenses>
                                            <r10:totalExpenses>13000.00</r10:totalExpenses>
                                            <r10:exceptionalItems>1000.00</r10:exceptionalItems>
                                            <r10:netProfitLossBeforeTax>-7000.00</r10:netProfitLossBeforeTax>
                                            <r10:taxAdjustments>1000.00</r10:taxAdjustments>
                                            <r10:currentYearTaxableProfitLoss>-6000.00</r10:currentYearTaxableProfitLoss>
                                            <r10:accountsReceivable>1000.00</r10:accountsReceivable>
                                            <r10:cashAndDeposits>1000.00</r10:cashAndDeposits>
                                            <r10:otherCurrentAssets>1000.00</r10:otherCurrentAssets>
                                            <r10:vehicles>1000.00</r10:vehicles>
                                            <r10:plantAndMachinery>1000.00</r10:plantAndMachinery>
                                            <r10:furnitureAndFittings>1000.00</r10:furnitureAndFittings>
                                            <r10:land>1000.00</r10:land>
                                            <r10:buildings>1000.00</r10:buildings>
                                            <r10:otherFixedAssets>1000.00</r10:otherFixedAssets>
                                            <r10:intangibles>1000.00</r10:intangibles>
                                            <r10:sharesAndOwnershipInterests>1000.00</r10:sharesAndOwnershipInterests>
                                            <r10:termDeposits>1000.00</r10:termDeposits>
                                            <r10:otherNonCurrentAssets>1000.00</r10:otherNonCurrentAssets>
                                            <r10:totalAssets>13000.00</r10:totalAssets>
                                            <r10:provisions>1000.00</r10:provisions>
                                            <r10:accountsPayable>1000.00</r10:accountsPayable>
                                            <r10:currentLoans>1000.00</r10:currentLoans>
                                            <r10:otherCurrentLiabilities>1000.00</r10:otherCurrentLiabilities>
                                            <r10:totalCurrentLiabilities>4000.00</r10:totalCurrentLiabilities>
                                            <r10:nonCurrentLiabilities>1000.00</r10:nonCurrentLiabilities>
                                            <r10:totalLiabilities>5000.00</r10:totalLiabilities>
                                            <r10:ownersEquity>8000.00</r10:ownersEquity>
                                            <r10:taxDepreciation>1000.00</r10:taxDepreciation>
                                            <r10:unTaxedRealisedGainsAndReceipts>1000.00</r10:unTaxedRealisedGainsAndReceipts>
                                            <r10:additionsToFixedAssets>1000.00</r10:additionsToFixedAssets>
                                            <r10:disposalOfFixedAssets>1000.00</r10:disposalOfFixedAssets>
                                            <r10:dividendsPaid>1000.00</r10:dividendsPaid>
                                            <r10:drawings>1000.00</r10:drawings>
                                            <r10:currentAccountYearEndBalances>1000.00</r10:currentAccountYearEndBalances>
                                            <r10:taxDeductibleLossOnDisposalOfFixedAssets>1000.00</r10:taxDeductibleLossOnDisposalOfFixedAssets>
                                        </ic:formFields>
                                    </ic:attachment>
                                    <ic:attachment>
                                        <ic:formType>833</ic:formType>
                                        <ic:formFields xsi:type="r833:FormFieldsType" xmlns:r833="urn:www.ird.govt.nz/GWS:types/ReturnIR833.v1">
                                            <r833:brightLine>true</r833:brightLine>
                                            <r833:propertyTitle>PT2</r833:propertyTitle>
                                            <r833:propertyAddress1>PA1</r833:propertyAddress1>
                                            <r833:propertyAddress2>PA2</r833:propertyAddress2>
                                            <r833:propertySuburb>PS</r833:propertySuburb>
                                            <r833:propertyCity>PC</r833:propertyCity>
                                            <r833:propertyPostCode>PPC</r833:propertyPostCode>
                                            <r833:dateOfPurchase>2019-01-01</r833:dateOfPurchase>
                                            <r833:dateOfSale>2019-02-02</r833:dateOfSale>
                                            <r833:salePrice>222222</r833:salePrice>
                                            <r833:purchasePrice>90000</r833:purchasePrice>
                                            <r833:deductibleCosts>10000</r833:deductibleCosts>
                                            <r833:totalCosts>100000</r833:totalCosts>
                                            <r833:netProfitLoss>122222.00</r833:netProfitLoss>
                                            <r833:shareOfOwnership>0.00</r833:shareOfOwnership>
                                            <r833:shareOfNetProfit>122222.00</r833:shareOfNetProfit>
                                        </ic:formFields>
                                    </ic:attachment>
                                    <ic:attachment>
                                        <ic:formType>CFC</ic:formType>
                                        <ic:formFields xsi:type="rCFC:FormFieldsType" xmlns:rCFC="urn:www.ird.govt.nz/GWS:types/ReturnCFC.v1">
                                            <rCFC:cfcDisclosures>
                                                <rCFC:cfcDisclosure>
                                                    <rCFC:cfcName>a</rCFC:cfcName>
                                                    <rCFC:balanceDate>2019-12-31</rCFC:balanceDate>
                                                    <rCFC:primaryActivity>INTANGIBLE</rCFC:primaryActivity>
                                                    <rCFC:jurisdiction>AUS</rCFC:jurisdiction>
                                                    <rCFC:currency>AUD</rCFC:currency>
                                                    <rCFC:grossRevenue>10000</rCFC:grossRevenue>
                                                    <rCFC:royaltyIncome>0</rCFC:royaltyIncome>
                                                    <rCFC:profitBeforeTax>2000</rCFC:profitBeforeTax>
                                                    <rCFC:totalAssets>0</rCFC:totalAssets>
                                                    <rCFC:australianCFC>false</rCFC:australianCFC>
                                                    <rCFC:activeCFC>false</rCFC:activeCFC>
                                                    <rCFC:employees>0</rCFC:employees>
                                                    <rCFC:earnings>0</rCFC:earnings>
                                                    <rCFC:totalAssetsLessFinancialAssets>0</rCFC:totalAssetsLessFinancialAssets>
                                                    <rCFC:incomeInterest>80</rCFC:incomeInterest>
                                                    <rCFC:attributedIncome>1000</rCFC:attributedIncome>
                                                    <rCFC:incomeAfterNetLoss>1000</rCFC:incomeAfterNetLoss>
                                                    <rCFC:taxCreditsEarnedInCurrentYear>0</rCFC:taxCreditsEarnedInCurrentYear>
                                                    <rCFC:taxCreditsUsedInCurrentYear>0</rCFC:taxCreditsUsedInCurrentYear>
                                                </rCFC:cfcDisclosure>
                                            </rCFC:cfcDisclosures>
                                            <rCFC:fifDisclosures>
                                                <rCFC:fifDisclosure>
                                                    <rCFC:fifName>a</rCFC:fifName>
                                                    <rCFC:balanceDate>2019-12-31</rCFC:balanceDate>
                                                    <rCFC:primaryActivity>INTANGIBLE</rCFC:primaryActivity>
                                                    <rCFC:jurisdiction>AUS</rCFC:jurisdiction>
                                                    <rCFC:currency>AUD</rCFC:currency>
                                                    <rCFC:sectionEX35AustralianExemption>false</rCFC:sectionEX35AustralianExemption>
                                                    <rCFC:activeBusinessTest>false</rCFC:activeBusinessTest>
                                                    <rCFC:incomeInterest>80</rCFC:incomeInterest>
                                                    <rCFC:attributedIncome>0</rCFC:attributedIncome>
                                                    <rCFC:incomeAfterNetLoss>1000</rCFC:incomeAfterNetLoss>
                                                    <rCFC:taxCreditsEarnedInCurrentYear>0</rCFC:taxCreditsEarnedInCurrentYear>
                                                    <rCFC:taxCreditsUsedInCurrentYear>0</rCFC:taxCreditsUsedInCurrentYear>
                                                </rCFC:fifDisclosure>
                                            </rCFC:fifDisclosures>
                                        </ic:formFields>
                                    </ic:attachment>
                                </r9:attachmentForms>
                            </rc:formFields>
                        </rc:fileBody>
                    </r9:fileRequest>
                </fil:FileRequestWrapper>
            </ret:ReturnFileRequestMsg>
        </ret:File>
    </soap:Body>
</soap:Envelope>